<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Objetivos-de-la-Clase" data-toc-modified-id="Objetivos-de-la-Clase-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Objetivos de la Clase</a></span><ul class="toc-item"><li><span><a href="#Roadmap" data-toc-modified-id="Roadmap-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Roadmap</a></span></li></ul></li><li><span><a href="#Datasets-de-Hoy" data-toc-modified-id="Datasets-de-Hoy-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Datasets de Hoy</a></span><ul class="toc-item"><li><span><a href="#Dataset-de-Temperaturas-Globales" data-toc-modified-id="Dataset-de-Temperaturas-Globales-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Dataset de Temperaturas Globales</a></span></li></ul></li><li><span><a href="#Datos-Temporales" data-toc-modified-id="Datos-Temporales-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Datos Temporales</a></span><ul class="toc-item"><li><span><a href="#Módulo-Datetime" data-toc-modified-id="Módulo-Datetime-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Módulo Datetime</a></span><ul class="toc-item"><li><span><a href="#Date" data-toc-modified-id="Date-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Date</a></span></li><li><span><a href="#Datetime" data-toc-modified-id="Datetime-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>Datetime</a></span></li><li><span><a href="#Instanciar-nuevos-Date-y-Datetimes" data-toc-modified-id="Instanciar-nuevos-Date-y-Datetimes-3.1.3"><span class="toc-item-num">3.1.3&nbsp;&nbsp;</span>Instanciar nuevos Date y Datetimes</a></span><ul class="toc-item"><li><span><a href="#Desde-timestamp" data-toc-modified-id="Desde-timestamp-3.1.3.1"><span class="toc-item-num">3.1.3.1&nbsp;&nbsp;</span>Desde timestamp</a></span></li></ul></li><li><span><a href="#TimeDelta" data-toc-modified-id="TimeDelta-3.1.4"><span class="toc-item-num">3.1.4&nbsp;&nbsp;</span>TimeDelta</a></span></li><li><span><a href="#Formatear-a-string" data-toc-modified-id="Formatear-a-string-3.1.5"><span class="toc-item-num">3.1.5&nbsp;&nbsp;</span>Formatear a string</a></span></li></ul></li></ul></li><li><span><a href="#Datos-temporales-en-Pandas" data-toc-modified-id="Datos-temporales-en-Pandas-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Datos temporales en Pandas</a></span><ul class="toc-item"><li><span><a href="#Paréntesis:-Función-Map" data-toc-modified-id="Paréntesis:-Función-Map-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Paréntesis: Función <code>Map</code></a></span></li><li><span><a href="#Valores-Inválidos" data-toc-modified-id="Valores-Inválidos-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Valores Inválidos</a></span></li><li><span><a href="#Indexado" data-toc-modified-id="Indexado-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Indexado</a></span></li><li><span><a href="#Pandas-Timedeltas" data-toc-modified-id="Pandas-Timedeltas-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Pandas Timedeltas</a></span></li></ul></li><li><span><a href="#Datos-Categóricos" data-toc-modified-id="Datos-Categóricos-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Datos Categóricos</a></span><ul class="toc-item"><li><span><a href="#Operaciones-con-categorías" data-toc-modified-id="Operaciones-con-categorías-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Operaciones con categorías</a></span></li><li><span><a href="#Nota-sobre-memoria" data-toc-modified-id="Nota-sobre-memoria-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Nota sobre memoria</a></span><ul class="toc-item"><li><span><a href="#Usando-Strings" data-toc-modified-id="Usando-Strings-5.2.1"><span class="toc-item-num">5.2.1&nbsp;&nbsp;</span>Usando Strings</a></span></li><li><span><a href="#Usando-Categorías" data-toc-modified-id="Usando-Categorías-5.2.2"><span class="toc-item-num">5.2.2&nbsp;&nbsp;</span>Usando Categorías</a></span></li></ul></li><li><span><a href="#Un-pequeño-merge-con-los-datos-anteriores" data-toc-modified-id="Un-pequeño-merge-con-los-datos-anteriores-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Un pequeño merge con los datos anteriores</a></span></li></ul></li><li><span><a href="#Ordinales" data-toc-modified-id="Ordinales-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Ordinales</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Operaciones-sobre-Series-Categóricas-con-Orden" data-toc-modified-id="Operaciones-sobre-Series-Categóricas-con-Orden-6.0.1"><span class="toc-item-num">6.0.1&nbsp;&nbsp;</span>Operaciones sobre Series Categóricas con Orden</a></span></li></ul></li><li><span><a href="#Ordenar-y-Filtrar-usando-Ordinales" data-toc-modified-id="Ordenar-y-Filtrar-usando-Ordinales-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Ordenar y Filtrar usando Ordinales</a></span></li><li><span><a href="#Nota-sobre-Merge-con-id-repetidos" data-toc-modified-id="Nota-sobre-Merge-con-id-repetidos-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Nota sobre Merge con id repetidos</a></span></li></ul></li><li><span><a href="#Anexo:-Cómo-Combinar-dos-Filtros/Máscaras-Booleanas" data-toc-modified-id="Anexo:-Cómo-Combinar-dos-Filtros/Máscaras-Booleanas-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Anexo: Cómo Combinar dos Filtros/Máscaras Booleanas</a></span></li></ul></div>

# Clase 12:  Tipos de Datos 2

**MDS7202: Laboratorio de Programación Científica para Ciencia de Datos**

**Profesor: Pablo Badilla**

## Objetivos de la Clase

- Comprender como unir distintas fuentes de datos a partir de `concatenaciones` y `merge`.

### Roadmap


**Unidad 2: Manejo de Datos con Pandas y AED**

- [X] Introducción a pandas: DataFrames, Series, Operaciones básicas y Filtrado.
- [X] Agregaciones.
- [X] Visualizaciones interactivas usando Plotly.
- [X] Concatenaciones y Merge de Dataframes.
- [X] Multi-índices y Trabajo con strings
- [ ]  Trabajo con datos temporales, categóricos y ordinales en Pandas.
- [ ] Análisis exploratorio de Datos (AED).

In [1]:
import pandas as pd

## Datasets de Hoy

### Dataset de Temperaturas Globales

![wbg_climate](./resources/wbg_climate.png)


https://climateknowledgeportal.worldbank.org/download-data

In [2]:
temp_df = pd.read_csv("./resources/temperature.csv")
temp_df.head(3)

   Temperature  Year Month      Country ISO3
0     -0.03110  1991   Jan  Afghanistan  AFG
1      1.43654  1991   Feb  Afghanistan  AFG
2      6.88685  1991   Mar  Afghanistan  AFG

In [3]:
pd.set_option('display.max_colwidth', None)

## Datos Temporales

### Módulo Datetime

Módulo built-in de python enfocado en manejar fechas y horas.

In [4]:
import datetime

#### Date

Objeto que almacena día, mes y año.

In [5]:
date_object = datetime.date.today()
print(date_object)

2021-10-04

In [6]:
date_object.day

4

In [7]:
date_object.month

10

In [8]:
date_object.year

2021

#### Datetime

Almacena segundos, minutos, hora, día, mes y año. También puede contener timezone.

In [9]:
datetime_object = datetime.datetime.now()
print(datetime_object)

2021-10-04 18:27:54.153364

#### Instanciar nuevos Date y Datetimes

In [10]:
d = datetime.date(2021, 9, 9)
print(d)

2021-09-09

In [11]:
print("Año:", d.year)
print("Mes:", d.month)
print("Día:", d.day)

Año: 2021
Mes: 9
Día: 9

In [12]:
d = datetime.datetime(2021, 4, 19, 10, 59, 55)
print(d)

2021-04-19 10:59:55

In [13]:
print("Hora:", d.hour)
print("Minuto:", d.minute)
print("Segundo:", d.second)
print("Microsegundo:", d.microsecond)

Hora: 10
Minuto: 59
Segundo: 55
Microsegundo: 0

Obviamente, estos objetos cuentan con las restricciones pertinentes

In [14]:
datetime.datetime(-1, 4, 19, 10, 59, 55)

ValueError: year -1 is out of range

In [15]:
datetime.datetime(9999, 4, 19, 10, 59, 55)

datetime.datetime(9999, 4, 19, 10, 59, 55)

Relacionado: https://es.wikipedia.org/wiki/Problema_del_a%C3%B1o_2000


El problema del año 2000, fue un bug o error de software causado por la costumbre que habían adoptado los programadores de omitir la centuria en el año para el almacenamiento de fechas (generalmente para economizar memoria), asumiendo que el software solo funcionaría durante los años cuyos números comenzaran con 19XX


![Antes](https://www.sopitas.com/wp-content/uploads/2016/04/ss.gif)

In [16]:
datetime.datetime(999999, 4, 19, 10, 59, 55)

ValueError: year 999999 is out of range

In [17]:
datetime.datetime(2020, 4, 19, 10, 60, 55)

ValueError: minute must be in 0..59

¿Y los años bisiestos?

In [18]:
datetime.datetime(2020, 2, 29)

datetime.datetime(2020, 2, 29, 0, 0)

In [19]:
datetime.datetime(2021, 2, 29)

ValueError: day is out of range for month

##### Desde timestamp

`A Unix timestamp is the number of seconds between a particular date and January 1, 1970 at UTC.`

In [20]:
timestamp = datetime.date.fromtimestamp(1326244364)
print("Date =", timestamp)

Date = 2012-01-10

> **Pregunta ❓**: ¿Podemos sumar o restar fechas?

In [21]:
delta = datetime.datetime(1, 1, 1)
delta

datetime.datetime(1, 1, 1, 0, 0)

In [22]:
d

datetime.datetime(2021, 4, 19, 10, 59, 55)

In [23]:
d + delta

TypeError: unsupported operand type(s) for +: 'datetime.datetime' and 'datetime.datetime'

#### TimeDelta

Permide sumar semanas, días, horas, etc... a objetos `date` y `datetime`.

In [24]:
d

datetime.datetime(2021, 4, 19, 10, 59, 55)

In [25]:
from datetime import timedelta

t1 = timedelta(weeks=2)
t1

datetime.timedelta(days=14)

In [26]:
d + t1

datetime.datetime(2021, 5, 3, 10, 59, 55)

¿Y tiempos negativos?

In [27]:
t2 = timedelta(minutes=-1)

In [28]:
d + t2

datetime.datetime(2021, 4, 19, 10, 58, 55)

In [29]:
d - t2

datetime.datetime(2021, 4, 19, 11, 0, 55)

¿Cambios de mes?

In [30]:
t3 = timedelta(days=1)

In [31]:
t3 + datetime.date(2020, 2, 28)

datetime.date(2020, 2, 29)

In [32]:
t3 + datetime.date(2021, 2, 28)

datetime.date(2021, 3, 1)

#### Formatear a string

In [33]:
s1 = d.strftime("%d/%m/%Y, %H:%M:%S")
# dd/mm/YY H:M:S format
s1

'19/04/2021, 10:59:55'

In [34]:
s1 = d.strftime("%d/%m/%Y")
# dd/mm/YY H:M:S format
s1

'19/04/2021'

In [35]:
s2 = d.strftime("%A %d %B %Y, %X")
# dd/mm/YY H:M:S format
s2

'Monday 19 April 2021, 10:59:55'

Referencia completa de formateo de fechas:

https://www.programiz.com/python-programming/datetime/strftime

## Datos temporales en Pandas

Pandas implementa su propio sistema de datetimes.
`pd.to_datetimes` nos permite convertir una `Serie` o un `DataFrame` en una `Serie` de datetimes.

In [36]:
temp_df.head(3)

   Temperature  Year Month      Country ISO3
0     -0.03110  1991   Jan  Afghanistan  AFG
1      1.43654  1991   Feb  Afghanistan  AFG
2      6.88685  1991   Mar  Afghanistan  AFG

In [37]:
import numpy as np

dates = temp_df.loc[:, ["Year", "Month"]]
dates["Day"] = np.ones(dates.shape[0])
dates

       Year Month  Day
0      1991   Jan  1.0
1      1991   Feb  1.0
2      1991   Mar  1.0
3      1991   Apr  1.0
4      1991   May  1.0
...     ...   ...  ...
59899  2016   Aug  1.0
59900  2016   Sep  1.0
59901  2016   Oct  1.0
59902  2016   Nov  1.0
59903  2016   Dec  1.0

[59904 rows x 3 columns]

In [38]:
pd.to_datetime(["1991", "Jan", "1.0"], yearfirst=True)

OutOfBoundsDatetime: Out of bounds nanosecond timestamp: 1-01-01 00:00:00

### Paréntesis: Función `Map`

Esta función permite hacer un `mapeo` (sustituir un valor por otro) sobre los elementos de una serie.

In [39]:
dates["Month"]

0        Jan
1        Feb
2        Mar
3        Apr
4        May
        ...
59899    Aug
59900    Sep
59901    Oct
59902    Nov
59903    Dec
Name: Month, Length: 59904, dtype: object

In [40]:
dates["Month"].map(
    {
        "Jan": 1,
        "Feb": 2,
        "Mar": 3,
        "Apr": 4,
        "May": 5,
        "Jun": 6,
        "Jul": 7,
        "Aug": 8,
        "Sep": 9,
        "Oct": 10,
        "Nov": 11,
        "Dec": 12,
    }
)

0         1
1         2
2         3
3         4
4         5
         ..
59899     8
59900     9
59901    10
59902    11
59903    12
Name: Month, Length: 59904, dtype: int64

In [41]:
dates["Month"] = dates["Month"].map(
    {
        "Jan": 1,
        "Feb": 2,
        "Mar": 3,
        "Apr": 4,
        "May": 5,
        "Jun": 6,
        "Jul": 7,
        "Aug": 8,
        "Sep": 9,
        "Oct": 10,
        "Nov": 11,
        "Dec": 12,
    }
)

In [42]:
dates

       Year  Month  Day
0      1991      1  1.0
1      1991      2  1.0
2      1991      3  1.0
3      1991      4  1.0
4      1991      5  1.0
...     ...    ...  ...
59899  2016      8  1.0
59900  2016      9  1.0
59901  2016     10  1.0
59902  2016     11  1.0
59903  2016     12  1.0

[59904 rows x 3 columns]

In [43]:
parsed_dates = pd.to_datetime(dates, yearfirst=True, infer_datetime_format=True)
parsed_dates

0       1991-01-01
1       1991-02-01
2       1991-03-01
3       1991-04-01
4       1991-05-01
           ...
59899   2016-08-01
59900   2016-09-01
59901   2016-10-01
59902   2016-11-01
59903   2016-12-01
Length: 59904, dtype: datetime64[ns]

In [44]:
temp_df["dates"] = parsed_dates
temp_df

       Temperature  Year Month      Country ISO3      dates
0         -0.03110  1991   Jan  Afghanistan  AFG 1991-01-01
1          1.43654  1991   Feb  Afghanistan  AFG 1991-02-01
2          6.88685  1991   Mar  Afghanistan  AFG 1991-03-01
3         12.93970  1991   Apr  Afghanistan  AFG 1991-04-01
4         17.07550  1991   May  Afghanistan  AFG 1991-05-01
...            ...   ...   ...          ...  ...        ...
59899     26.09480  2016   Aug    Venezuela  VEN 2016-08-01
59900     26.22090  2016   Sep    Venezuela  VEN 2016-09-01
59901     26.62850  2016   Oct    Venezuela  VEN 2016-10-01
59902     26.27680  2016   Nov    Venezuela  VEN 2016-11-01
59903     26.12860  2016   Dec    Venezuela  VEN 2016-12-01

[59904 rows x 6 columns]

In [45]:
temp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59904 entries, 0 to 59903
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Temperature  59904 non-null  float64
 1   Year         59904 non-null  int64
 2   Month        59904 non-null  object
 3   Country      59904 non-null  object
 4   ISO3         59904 non-null  object
 5   dates        59904 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 2.7+ MB

### Valores Inválidos

Puede ocurrir que tengamos algún dato inválido que no podamos transformar a `datetime`.

`pd.to_datetime` ofrece el siguiente parámetro para manejar estos problemas:

`errors{‘ignore’, ‘raise’, ‘coerce’}, default ‘raise’`

- If `raise`, then invalid parsing will raise an exception.

- If `coerce`, then invalid parsing will be set as NaT.

- If `ignore`, then invalid parsing will return the input.


**Nota:** NaT = Not a Time

In [46]:
pd.to_datetime(["2009/07/31", "asd"], errors="coerce")

DatetimeIndex(['2009-07-31', 'NaT'], dtype='datetime64[ns]', freq=None)

### Indexado

Podemos fijar las fechas como índices y luego indexar por rangos de estas

In [47]:
temperaturas_por_fecha = temp_df.set_index("dates")
temperaturas_por_fecha

            Temperature  Year Month      Country ISO3
dates
1991-01-01     -0.03110  1991   Jan  Afghanistan  AFG
1991-02-01      1.43654  1991   Feb  Afghanistan  AFG
1991-03-01      6.88685  1991   Mar  Afghanistan  AFG
1991-04-01     12.93970  1991   Apr  Afghanistan  AFG
1991-05-01     17.07550  1991   May  Afghanistan  AFG
...                 ...   ...   ...          ...  ...
2016-08-01     26.09480  2016   Aug    Venezuela  VEN
2016-09-01     26.22090  2016   Sep    Venezuela  VEN
2016-10-01     26.62850  2016   Oct    Venezuela  VEN
2016-11-01     26.27680  2016   Nov    Venezuela  VEN
2016-12-01     26.12860  2016   Dec    Venezuela  VEN

[59904 rows x 5 columns]

In [48]:
# Rango 1995-1-1 al 199-12-1
temperaturas_por_fecha.loc["1995-1-1":"1999-12-1"]

            Temperature  Year Month      Country ISO3
dates
1995-01-01      0.92358  1995   Jan  Afghanistan  AFG
1995-02-01      2.96133  1995   Feb  Afghanistan  AFG
1995-03-01      6.36893  1995   Mar  Afghanistan  AFG
1995-04-01     12.26760  1995   Apr  Afghanistan  AFG
1995-05-01     18.11870  1995   May  Afghanistan  AFG
...                 ...   ...   ...          ...  ...
1999-08-01     24.86170  1999   Aug    Venezuela  VEN
1999-09-01     25.33310  1999   Sep    Venezuela  VEN
1999-10-01     25.35280  1999   Oct    Venezuela  VEN
1999-11-01     25.94590  1999   Nov    Venezuela  VEN
1999-12-01     25.39510  1999   Dec    Venezuela  VEN

[11520 rows x 5 columns]

In [50]:
temperaturas_por_fecha.loc["1999-11-1":"1999-12-1"]

            Temperature  Year Month      Country ISO3
dates
1999-11-01      8.22556  1999   Nov  Afghanistan  AFG
1999-12-01      3.80288  1999   Dec  Afghanistan  AFG
1999-11-01      7.79985  1999   Nov      Albania  ALB
1999-12-01      4.74799  1999   Dec      Albania  ALB
1999-11-01     17.59640  1999   Nov      Algeria  DZA
...                 ...   ...   ...          ...  ...
1999-12-01      2.38418  1999   Dec   Uzbekistan  UZB
1999-11-01     24.71980  1999   Nov      Vanuatu  VUT
1999-12-01     24.55080  1999   Dec      Vanuatu  VUT
1999-11-01     25.94590  1999   Nov    Venezuela  VEN
1999-12-01     25.39510  1999   Dec    Venezuela  VEN

[384 rows x 5 columns]

### Pandas Timedeltas

En general podemos construir un `pd.Timedelta` con los parámetros:

`weeks, days, hours, minutes, seconds, milliseconds, microseconds, nanoseconds`

In [51]:
ptd1 = pd.Timedelta(weeks=2)
ptd1

Timedelta('14 days 00:00:00')

In [52]:
temp_df["dates"] + ptd1

0       1991-01-15
1       1991-02-15
2       1991-03-15
3       1991-04-15
4       1991-05-15
           ...
59899   2016-08-15
59900   2016-09-15
59901   2016-10-15
59902   2016-11-15
59903   2016-12-15
Name: dates, Length: 59904, dtype: datetime64[ns]

Y podemos también hacer Broadcasting con `datetime.timedeltas`

In [53]:
temp_df["dates"] + datetime.timedelta(days=-1)

0       1990-12-31
1       1991-01-31
2       1991-02-28
3       1991-03-31
4       1991-04-30
           ...
59899   2016-07-31
59900   2016-08-31
59901   2016-09-30
59902   2016-10-31
59903   2016-11-30
Name: dates, Length: 59904, dtype: datetime64[ns]

## Datos Categóricos

Una variable categórica es un tipo de dato que puede tomar un número limitado (y usualmente fijo) de posibles valores.
Ejemplos de esto: Género, clase social, tipo de sangre, etc...

En general, guardar los datos como categóricos es mucho más eficiente que guardarlos como string. Según la referencia de pandas:

> The memory usage of a Categorical is proportional to the number of categories plus the length of the data. In contrast, an object dtype is a constant times the length of the data.

Como ejemplo, usaremos los continentes a los que pertenece cada país:

In [54]:
countries_and_continents = pd.read_csv("resources/country-and-continent.csv")
countries_and_continents = countries_and_continents.loc[
    :, ["Continent_Name", "Country_Name"]
]
countries_and_continents

    Continent_Name                                  Country_Name
0             Asia              Afghanistan, Islamic Republic of
1           Europe                                       Albania
2       Antarctica  Antarctica (the territory South of 60 deg S)
3           Africa      Algeria, People's Democratic Republic of
4          Oceania                                American Samoa
..             ...                                           ...
257         Africa                                        Zambia
258        Oceania                            Disputed Territory
259           Asia                Iraq-Saudi Arabia Neutral Zone
260           Asia                   United Nations Neutral Zone
261           Asia                               Spratly Islands

[262 rows x 2 columns]

Declaramos una variable como categórica transformando la serie a `category` con `.astype("category")`:

In [55]:
countries_and_continents[
    "Continent_Name"
]

0            Asia
1          Europe
2      Antarctica
3          Africa
4         Oceania
          ...
257        Africa
258       Oceania
259          Asia
260          Asia
261          Asia
Name: Continent_Name, Length: 262, dtype: object

In [56]:
countries_and_continents["Continent_Name"] = countries_and_continents[
    "Continent_Name"
].astype("category")
countries_and_continents["Continent_Name"]

0            Asia
1          Europe
2      Antarctica
3          Africa
4         Oceania
          ...
257        Africa
258       Oceania
259          Asia
260          Asia
261          Asia
Name: Continent_Name, Length: 262, dtype: category
Categories (7, object): ['Africa', 'Antarctica', 'Asia', 'Europe', 'North America', 'Oceania', 'South America']

Podemos acceder a las categorías con:

In [57]:
countries_and_continents["Continent_Name"].cat.categories

Index(['Africa', 'Antarctica', 'Asia', 'Europe', 'North America', 'Oceania',
       'South America'],
      dtype='object')

### Operaciones con categorías

Podemos renombrar categorías:

In [58]:
countries_and_continents["Continent_Name"] = countries_and_continents[
    "Continent_Name"].cat.rename_categories([
        "Africa",
        "Antarctica",
        "Asia",
        "Europa",
        "América del Norte",
        "Oceania",
        "América del Sur",
    ])

countries_and_continents["Continent_Name"]

0            Asia
1          Europa
2      Antarctica
3          Africa
4         Oceania
          ...
257        Africa
258       Oceania
259          Asia
260          Asia
261          Asia
Name: Continent_Name, Length: 262, dtype: category
Categories (7, object): ['Africa', 'Antarctica', 'Asia', 'Europa', 'América del Norte', 'Oceania', 'América del Sur']

In [59]:
countries_and_continents.sample(10)

        Continent_Name                      Country_Name
29             Oceania                   Solomon Islands
144             Europa           Monaco, Principality of
105             Europa                           Iceland
147             Europa                        Montenegro
39              Africa                        Cape Verde
102  América del Norte                          Honduras
205             Africa                           Senegal
98     América del Sur  Guyana, Co-operative Republic of
252               Asia                        Uzbekistan
189             Africa                           Reunion

In [60]:
countries_and_continents["Continent_Name"] = countries_and_continents[
    "Continent_Name"
].cat.rename_categories({"Europe": "Europa",})

In [61]:
countries_and_continents

    Continent_Name                                  Country_Name
0             Asia              Afghanistan, Islamic Republic of
1           Europa                                       Albania
2       Antarctica  Antarctica (the territory South of 60 deg S)
3           Africa      Algeria, People's Democratic Republic of
4          Oceania                                American Samoa
..             ...                                           ...
257         Africa                                        Zambia
258        Oceania                            Disputed Territory
259           Asia                Iraq-Saudi Arabia Neutral Zone
260           Asia                   United Nations Neutral Zone
261           Asia                               Spratly Islands

[262 rows x 2 columns]

Se pueden agregar categorías

In [62]:
countries_and_continents["Continent_Name"].cat.add_categories(["Atlantida"])

0            Asia
1          Europa
2      Antarctica
3          Africa
4         Oceania
          ...
257        Africa
258       Oceania
259          Asia
260          Asia
261          Asia
Name: Continent_Name, Length: 262, dtype: category
Categories (8, object): ['Africa', 'Antarctica', 'Asia', 'Europa', 'América del Norte', 'Oceania', 'América del Sur', 'Atlantida']

Como también eliminarlas

In [63]:
# Remover las no usadas
countries_and_continents["Continent_Name"].cat.remove_unused_categories()

0            Asia
1          Europa
2      Antarctica
3          Africa
4         Oceania
          ...
257        Africa
258       Oceania
259          Asia
260          Asia
261          Asia
Name: Continent_Name, Length: 262, dtype: category
Categories (7, object): ['Africa', 'Antarctica', 'Asia', 'Europa', 'América del Norte', 'Oceania', 'América del Sur']

In [64]:
# Como también remover una categoría completa. Esto deja los valores de esa categoría con NaN
countries_and_continents["Continent_Name"].cat.remove_categories(["Europa"])

0            Asia
1             NaN
2      Antarctica
3          Africa
4         Oceania
          ...
257        Africa
258       Oceania
259          Asia
260          Asia
261          Asia
Name: Continent_Name, Length: 262, dtype: category
Categories (6, object): ['Africa', 'Antarctica', 'Asia', 'América del Norte', 'Oceania', 'América del Sur']

### Nota sobre memoria

Como habíamos dicho, es mucho más eficiente guardar variables categóricas que strings.
Podemos ver esto en el siguiente ejemplo:

#### Usando Strings

In [65]:
strings = pd.DataFrame(["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"] *
                       1000000,
                       columns=["var"])
strings

        var
0         A
1         B
2         C
3         D
4         E
...      ..
9999995   F
9999996   G
9999997   H
9999998   I
9999999   J

[10000000 rows x 1 columns]

In [67]:
# strings no tienen .cat
strings['var'].cat

AttributeError: Can only use .cat accessor with a 'category' dtype

In [ ]:
# observen la cantidad de memoria.
strings.info()

#### Usando Categorías

In [ ]:
strings = pd.DataFrame(
    ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"] * 1000000, columns=["var"]
)
strings["var"] = strings["var"].astype("category")
strings

In [ ]:
strings["var"]

In [68]:
strings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000000 entries, 0 to 9999999
Data columns (total 1 columns):
 #   Column  Dtype
---  ------  -----
 0   var     object
dtypes: object(1)
memory usage: 76.3+ MB

### Un pequeño merge con los datos anteriores

Notar que en esta versión se especificó sobre que variables hacer el merge en ambos datasets.

In [69]:
temperaturas_agregadas = (
    temp_df
    .groupby("Country")
    .agg({"Temperature": ["mean", "std"]})
)

temperaturas_agregadas.columns = temperaturas_agregadas.columns.droplevel()
temperaturas_agregadas = temperaturas_agregadas.reset_index()
temperaturas_agregadas.columns = ['Country', 'Mean temperature', 'Std temperature']
temperaturas_agregadas


merged_data = pd.merge(
    temperaturas_agregadas,
    countries_and_continents,
    how="left",
    left_on="Country",
    right_on="Country_Name",
)

merged_data

,Country,Mean temperature,Std temperature,Continent_Name,Country_Name
0,Afghanistan,13.545609,8.695203,NaN,NaN
1,Albania,12.106435,7.101392,Europa,Albania
2,Algeria,23.439610,7.473115,NaN,NaN
3,Andorra,11.953746,6.014903,NaN,NaN
4,Angola,22.133815,1.710757,Africa,Angola
...,...,...,...,...,...
193,United States,7.617000,9.077944,América del Norte,United States
194,Uruguay,17.941855,4.505184,NaN,NaN
195,Uzbekistan,13.158793,10.837303,Asia,Uzbekistan
196,Vanuatu,24.123163,1.204321,Oceania,Vanuatu
197,Venezuela,25.865055,0.621697,NaN,NaN

## Ordinales

Son variables categóricas con un orden definido.

Por ejemplo, hagamos una clasificación muy simple del clima a partir de la temperatura media. Para esto, calculemos cuartiles:

> Nota: Los elementos meteorológicos a tomar en cuenta para definir un clima son la temperatura, la presión, el viento, la humedad y la precipitación. Referencias: https://es.wikipedia.org/wiki/Clima

In [70]:
mean_temp = merged_data["Mean temperature"]
mean_temp

0      13.545609
1      12.106435
2      23.439610
3      11.953746
4      22.133815
         ...
193     7.617000
194    17.941855
195    13.158793
196    24.123163
197    25.865055
Name: Mean temperature, Length: 198, dtype: float64

In [71]:
mean_temp.describe()

count    198.000000
mean      18.889212
std        8.721793
min      -17.072330
25%       11.300543
50%       22.726409
75%       25.844148
max       28.883495
Name: Mean temperature, dtype: float64

In [72]:
# Spoiler Lab 3!!

clima_ordinal = pd.qcut(mean_temp, 5, labels=["Polar", "Frio", "Templado", "Calido", "Muy Calido"])
clima_ordinal

0          Frio
1          Frio
2      Templado
3          Frio
4      Templado
         ...
193       Polar
194        Frio
195        Frio
196    Templado
197      Calido
Name: Mean temperature, Length: 198, dtype: category
Categories (5, object): ['Polar' < 'Frio' < 'Templado' < 'Calido' < 'Muy Calido']

#### Operaciones sobre Series Categóricas con Orden

In [73]:
clima_ordinal.value_counts()

Polar         40
Frio          40
Muy Calido    40
Templado      39
Calido        39
Name: Mean temperature, dtype: int64

In [74]:
clima_ordinal.min()

'Polar'

In [75]:
clima_ordinal.max()

'Muy Calido'

In [76]:
clima_ordinal.mode()

0         Polar
1          Frio
2    Muy Calido
Name: Mean temperature, dtype: category
Categories (5, object): ['Polar' < 'Frio' < 'Templado' < 'Calido' < 'Muy Calido']

---

### Ordenar y Filtrar usando Ordinales

In [77]:
merged_data["Clima cuartiles"] = clima_ordinal
merged_data.head(3)

,Country,Mean temperature,Std temperature,Continent_Name,Country_Name,Clima cuartiles
0,Afghanistan,13.545609,8.695203,NaN,NaN,Frio
1,Albania,12.106435,7.101392,Europa,Albania,Frio
2,Algeria,23.439610,7.473115,NaN,NaN,Templado

In [78]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 198 entries, 0 to 197
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country           198 non-null    object
 1   Mean temperature  198 non-null    float64
 2   Std temperature   198 non-null    float64
 3   Continent_Name    131 non-null    category
 4   Country_Name      131 non-null    object
 5   Clima cuartiles   198 non-null    category
dtypes: category(2), float64(2), object(2)
memory usage: 8.7+ KB

In [79]:
merged_data = merged_data.sort_values(["Clima cuartiles", "Mean temperature"])
merged_data

,Country,Mean temperature,Std temperature,Continent_Name,Country_Name,Clima cuartiles
71,Greenland,-17.072330,8.745566,América del Norte,Greenland,Polar
32,Canada,-5.963874,12.528132,América del Norte,Canada,Polar
150,Russia,-5.255763,14.663405,Europa,Russia,Polar
119,Mongolia,0.598241,13.699369,Asia,Mongolia,Polar
133,Norway,1.726860,7.287373,Europa,Norway,Polar
...,...,...,...,...,...,...
114,Mauritania,28.416357,4.659151,NaN,NaN,Muy Calido
188,Tuvalu,28.504638,0.393742,Oceania,Tuvalu,Muy Calido
155,Senegal,28.630989,2.062197,Africa,Senegal,Muy Calido
28,Burkina Faso,28.698612,2.397689,Africa,Burkina Faso,Muy Calido
111,Mali,28.883495,4.116799,Africa,Mali,Muy Calido

### Nota sobre Merge con id repetidos

> Pregunta: ¿Qué sucede si hacemos un merge de una fila con muchas otras con igual identificador?

In [80]:
merged_data["Clima cuartiles"].cat.categories

Index(['Polar', 'Frio', 'Templado', 'Calido', 'Muy Calido'], dtype='object')

In [81]:
mask = merged_data["Clima cuartiles"] < "Frio"
mask

71      True
32      True
150     True
119     True
133     True
       ...
114    False
188    False
155    False
28     False
111    False
Name: Clima cuartiles, Length: 198, dtype: bool

In [82]:
merged_data[mask]

,Country,Mean temperature,Std temperature,Continent_Name,Country_Name,Clima cuartiles
71,Greenland,-17.072330,8.745566,América del Norte,Greenland,Polar
32,Canada,-5.963874,12.528132,América del Norte,Canada,Polar
150,Russia,-5.255763,14.663405,Europa,Russia,Polar
119,Mongolia,0.598241,13.699369,Asia,Mongolia,Polar
133,Norway,1.726860,7.287373,Europa,Norway,Polar
80,Iceland,2.307253,4.468936,Europa,Iceland,Polar
62,Finland,2.402188,9.278735,Europa,Finland,Polar
174,Sweden,2.537722,8.185242,Europa,Sweden,Polar
96,Kyrgyzstan,3.137480,9.972644,NaN,NaN,Polar
103,Liechtenstein,3.549368,5.943636,NaN,NaN,Polar
177,Tajikistan,4.001360,8.788011,Asia,Tajikistan,Polar
57,Estonia,6.166056,8.199942,Europa,Estonia,Polar
131,NorthKorea,6.223913,11.365693,NaN,NaN,Polar
98,Latvia,6.696891,8.127505,Europa,Latvia,Polar
175,Switzerland,6.713588,6.237274,Europa,Switzerland,Polar
59,FaroeIslands,6.770316,2.911743,NaN,NaN,Polar
91,Kazakhstan,6.810408,12.792550,Europa,Kazakhstan,Polar
92,Kazakhstan,6.810408,12.792550,Asia,Kazakhstan,Polar
66,Georgia,6.957606,8.942169,Europa,Georgia,Polar
67,Georgia,6.957606,8.942169,Asia,Georgia,Polar
37,China,7.039332,9.721250,NaN,NaN,Polar
10,Austria,7.202215,6.993245,Europa,Austria,Polar
104,Lithuania,7.280419,8.113566,Europa,Lithuania,Polar
17,Belarus,7.362349,8.803962,Europa,Belarus,Polar
193,United States,7.617000,9.077944,América del Norte,United States,Polar
7,Armenia,7.803382,9.697264,Europa,Armenia,Polar
8,Armenia,7.803382,9.697264,Asia,Armenia,Polar
159,Slovakia,8.452959,7.797643,NaN,NaN,Polar
36,Chile,8.454478,3.126838,América del Sur,Chile,Polar
142,Poland,8.667610,7.471490,Europa,Poland,Polar
48,Denmark,8.678213,6.136734,Europa,Denmark,Polar
46,CzechRepublic,8.756214,7.398374,NaN,NaN,Polar
192,United Kingdom,9.062469,4.253525,Europa,United Kingdom,Polar
190,Ukraine,9.072880,9.178330,Europa,Ukraine,Polar
68,Germany,9.429345,6.574786,Europa,Germany,Polar
146,Republic of Montenegro,9.609226,7.388896,NaN,NaN,Polar
85,Ireland,9.640844,3.684947,Europa,Ireland,Polar
160,Slovenia,9.677381,7.151006,Europa,Slovenia,Polar
149,Romania,9.690750,8.359718,Europa,Romania,Polar
105,Luxembourg,9.932402,6.138378,Europa,Luxembourg,Polar

## Anexo: Cómo Combinar dos Filtros/Máscaras Booleanas

Se puede usar las operaciones `|` (or) y `&` and para combinar dos máscaras.

- `|` simboliza un ó lógico.
- `&` simboliza un y lógico.

In [83]:
mask_2 = (
    (merged_data["Clima cuartiles"] < "Frio") | 
    (merged_data["Clima cuartiles"] == "Templado"))
mask_2

71      True
32      True
150     True
119     True
133     True
       ...
114    False
188    False
155    False
28     False
111    False
Name: Clima cuartiles, Length: 198, dtype: bool

In [84]:
merged_data[mask_2]

,Country,Mean temperature,Std temperature,Continent_Name,Country_Name,Clima cuartiles
71,Greenland,-17.072330,8.745566,América del Norte,Greenland,Polar
32,Canada,-5.963874,12.528132,América del Norte,Canada,Polar
150,Russia,-5.255763,14.663405,Europa,Russia,Polar
119,Mongolia,0.598241,13.699369,Asia,Mongolia,Polar
133,Norway,1.726860,7.287373,Europa,Norway,Polar
...,...,...,...,...,...,...
121,Mozambique,24.281818,2.410008,Africa,Mozambique,Templado
61,Fiji,24.325886,1.436607,NaN,NaN,Templado
54,ElSalvador,24.371996,1.016290,NaN,NaN,Templado
51,DominicanRepublic,24.483362,1.356441,NaN,NaN,Templado
47,Democratic Republic of Congo,24.537549,0.613208,NaN,NaN,Templado